Data  source : <a href="https://www.cia.gov/the-world-factbook/">CIA World Facebook</a>

In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [2]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [3]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table' and name='facts';

Done.

[('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [5]:
%%sql
SELECT *
  FROM facts LIMIT 5

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [8]:
# Summary statistics

%%sql
SELECT MIN(population),MAX(population),MIN(population_growth),MAX(population_growth)
 FROM facts

Done.

[(0, 7256490011, 0.0, 4.02)]

In [10]:
# Minimum population from the table

%%sql
SELECT name FROM facts WHERE Population = (
SELECT MIN(population) FROM facts)

Done.

[('Antarctica',)]

In [11]:
# Maximum population from the table

%%sql
SELECT name FROM facts WHERE Population = (
SELECT MAX(population) FROM facts)

Done.

[('World',)]

In [12]:
# minimum population

%%sql
SELECT name FROM facts WHERE Population = (
SELECT MIN(population) FROM facts) AND name!='World'

Done.

[('Antarctica',)]

In [16]:
# maximum population

%%sql
SELECT name FROM facts WHERE Population = (
SELECT MAX(population) FROM (select * from facts where name<>'World'))

Done.

[('China',)]

In [20]:
# maximum population growth 

%%sql
SELECT name FROM facts WHERE population_growth = (
SELECT MIN(population_growth) FROM (select * from facts where name<>'World'))

Done.

[('Holy See (Vatican City)', 0.0),
 ('Cocos (Keeling) Islands', 0.0),
 ('Greenland', 0.0),
 ('Pitcairn Islands', 0.0)]

In [21]:
# minimum population growth

%%sql
SELECT name FROM facts WHERE population_growth = (
SELECT MAX(population_growth) FROM (select * from facts where name<>'World'))

Done.

[('South Sudan',)]

In [26]:
# Average population and Average area

%%sql
select avg(population) as avg_population,avg(area) as avg_area FROM facts

Done.

[(62094928.32231405, 555093.546184739)]

In [27]:
# Above-average values for population.
# Below-average values for area.

%%sql
select name from facts where population >
(select avg(population) FROM facts) and area > (select avg(area) from facts)

Done.

[('Brazil',),
 ('China',),
 ('Congo, Democratic Republic of the',),
 ('Egypt',),
 ('Ethiopia',),
 ('France',),
 ('India',),
 ('Indonesia',),
 ('Iran',),
 ('Mexico',),
 ('Nigeria',),
 ('Pakistan',),
 ('Russia',),
 ('Turkey',),
 ('United States',),
 ('European Union',)]